In [ ]:
import pandas as pd

In [ ]:
df_movies = pd.read_csv('IMDb movies.csv',low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [ ]:
# select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year',
                       'genre', 'country', 'director', 'actors']]

df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# concat()

## Concatenate vertically

In [11]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['E', 'F', 'G', 'F'],
                    'age': [40, 21, 19, 24]})

pd.concat([df1, df2],ignore_index=True)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  F   24

In [14]:
# 50% sample
df_sample = df_movies.sample(frac=0.5)
print(df_movies.shape)
print(df_sample.shape)

(85855, 7)
(42928, 7)

In [16]:
df_concat_vertically = pd.concat([df_sample, df_movies], axis=0)
df_concat_vertically.head(5)

,imdb_title_id,title,year,genre,country,director,actors
70175,tt3173910,Hasee Toh Phasee,2014,"Comedy, Romance",India,Vinil Mathew,"Sidharth Malhotra, Parineeti Chopra, Adah Shar..."
28454,tt0111168,Sherlock: Undercover Dog,1994,"Adventure, Comedy, Crime",USA,Richard Harding Gardner,"Benjamin Eroen, Anthony Simmons, Cooper Camero..."
60290,tt1640202,Scene di un'estate,2010,Comedy,Turkey,Ozan Açiktan,"Gülsüm Alkan, Ibrahim Büyükak, Emre Canpolat, ..."
155,tt0010193,The Greatest Question,1919,Drama,USA,D.W. Griffith,"Lillian Gish, Robert Harron, Ralph Graves, Eug..."
42427,tt0332381,Hafið,2002,"Comedy, Drama","Iceland, France, Norway",Baltasar Kormákur,"Gunnar Eyjólfsson, Hilmir Snær Guðnason, Hélèn..."

## Concatenate horizontally

In [17]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

pd.concat([df1, df2],axis=1)

  id  age           job
0  A   30        Doctor
1  B   23  Statistician
2  C   25    Accountant
3  D   22     Developer

In [21]:
# concatenate df_movies and df_ratings on 'imdb_title_id' (horizontally along the columns)
df_concat_horizontally = pd.concat([
    df_movies.set_index('imdb_title_id'),df_ratings.set_index('imdb_title_id'),
],axis=1)

df_concat_horizontally.head()

,title,year,genre,country,director,actors,total_votes,mean_vote
imdb_title_id,,,,,,,,
tt0000009,Miss Jerry,1894,Romance,USA,Alexander Black,"Blanche Bayliss, William Courtenay, Chauncey D...",154,5.9
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,Charles Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",589,6.3
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",Urban Gad,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",188,6.0
tt0002101,Cleopatra,1912,"Drama, History",USA,Charles L. Gaskill,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",446,5.3
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,"Francesco Bertolini, Adolfo Padovan","Salvatore Papa, Arturo Pirovano, Giuseppe de L...",2237,6.9